Repository: ArkDeck/ArkDeck
Catalog: windows/App/Strings/*/Resources.resw
Source language: en_us
Languages: zh_hans

# windows_imports_release_message
source: The Runtime releases Import %1$@ (generation %2$@). A Job can no longer use its Artifact.
zh_hans: Runtime 会释放导入 %1$@（代次 %2$@），之后 Job 不能再使用它的 Artifact。

# windows_imports_release_confirm
source: Release
zh_hans: 释放

# windows_imports_release_done
source: Released.
zh_hans: 已释放。

# windows_imports_release_failed
source: The Import was not released
zh_hans: 导入未释放

# windows_agents_action_id
source: Human action
zh_hans: 人工操作

# windows_imports_id
source: Import
zh_hans: 导入

# windows_navigation_debug
source: Debug
zh_hans: 调试

# windows_debug_jobs_cancelFailed
source: Runtime refused the cancellation request
zh_hans: Runtime 拒绝了取消请求

# windows_debug_needsTarget
source: Choose an adopted Target first.
zh_hans: 请先选择一个已接管的 Target。

# windows_debug_needsInputs
source: Complete the fields above with valid values first.
zh_hans: 请先用有效值填写上面的字段。

# windows_debug_operationUnavailable
source: The Runtime cannot run this operation now; the reasons are shown above.
zh_hans: Runtime 当前无法运行此操作，原因见上方。

# windows_debug_busy
source: A Job of this tab is running; wait for it or stop it first.
zh_hans: 此标签页有 Job 正在运行；请等待其结束或先停止它。

# windows_debug_running
source: Running %@
zh_hans: 正在运行 %@

# windows_debug_selectedTab
source: %@ tab
zh_hans: %@ 标签页

# windows_navigation_flash
source: Flash
zh_hans: 刷机

# windows_flash_action_power
source: Keep the device connected and on stable power. Do not shut down, sleep or unplug the PC during flashing.
zh_hans: 请保持设备连接和稳定供电，刷机期间不要关机、睡眠或拔掉电脑电源。

# windows_flash_progress_keepConnected
source: Do not unplug, power off, or put the PC to sleep. The current partition write will not be force-stopped.
zh_hans: 请勿拔线、断电或让电脑睡眠，当前分区写入不会被强行中断。

# windows_flash_runtime_criticalWrite
source: Writing a partition — this critical step cannot be interrupted. Stopping only prevents later steps. Do not put the PC to sleep, disconnect power, or unplug the device.
zh_hans: 正在写入分区——此关键步骤不可中断，停止只会阻止后续步骤。请勿让电脑睡眠、断电或拔线。

# windows_flash_chooseImage_invalid
source: Choose a .tar.gz, .zip, or .7z image archive.
zh_hans: 请选择 .tar.gz、.zip 或 .7z 镜像压缩包。

# windows_flash_targetChanged
source: The selected target changed; the exact plan is prepared again.
zh_hans: 所选 Target 已变更，将重新准备精确计划。

# windows_traceViewer_capture
source: Capture
zh_hans: 采集

# windows_traceViewer_captureHelp
source: Capture a trace from a connected OpenHarmony device
zh_hans: 从已连接的 OpenHarmony 设备采集 Trace

# windows_traceViewer_open
source: Open
zh_hans: 打开

# windows_traceViewer_openTrace
source: Open Trace…
zh_hans: 打开 Trace…

# windows_traceViewer_captureTrace
source: Capture Trace…
zh_hans: 采集 Trace…

# windows_traceViewer_reload
source: Reload
zh_hans: 重新加载

# windows_traceViewer_recent
source: Recent
zh_hans: 最近打开

# windows_traceViewer_removeRecent
source: Remove from Recent
zh_hans: 从最近记录移除

# windows_traceViewer_missingName
source: %1$@, missing
zh_hans: %1$@，文件缺失

# windows_traceViewer_missingPath
source: Missing — %1$@
zh_hans: 文件缺失 — %1$@

# windows_traceViewer_idleTitle
source: Open a trace
zh_hans: 打开 Trace

# windows_traceViewer_idleDetail
source: Open, drop, or choose a recent .htrace/.ftrace/.systrace file.
zh_hans: 打开或拖入 .htrace/.ftrace/.systrace 文件，也可选择最近打开的文件。

# windows_traceViewer_unavailable
source: Trace unavailable
zh_hans: Trace 不可用

# windows_traceViewer_diagnostics
source: Diagnostics
zh_hans: 诊断详情

# windows_traceViewer_retry
source: Retry
zh_hans: 重试

# windows_traceViewer_chooseAnother
source: Choose Another File…
zh_hans: 选择其他文件…

# windows_traceViewer_inspector
source: Inspector
zh_hans: 检查器

# windows_traceViewer_duration
source: Duration
zh_hans: 时长

# windows_traceViewer_sourceBytes
source: Source bytes
zh_hans: 源文件大小

# windows_traceViewer_schema
source: Schema
zh_hans: Schema 指纹

# windows_traceViewer_cache
source: Cache
zh_hans: 缓存

# windows_traceViewer_hit
source: Hit
zh_hans: 命中

# windows_traceViewer_miss
source: Miss
zh_hans: 未命中

# windows_traceViewer_nothingSelected
source: Select an event or drag a time range.
zh_hans: 选择事件或拖动选取时间范围。

# windows_traceViewer_title
source: Trace Viewer
zh_hans: Trace 查看器

# windows_traceViewer_back
source: Back to Trace
zh_hans: 返回 Trace

# windows_traceViewer_noParser
source: No ArkTrace parser is distributed for Windows, so this PC cannot draw the timeline. The file's size and SHA-256 are shown; for a captured Trace, the Runtime's Trace inspector is asked.
zh_hans: Windows 版未分发 ArkTrace 解析器，本机无法绘制时间线。此处显示文件大小和 SHA-256；对于采集得到的 Trace，会询问 Runtime 的 Trace 检查器。

# windows_traceViewer_runtimeInspection
source: Runtime inspection
zh_hans: Runtime 检查

# windows_traceViewer_engine
source: Engine
zh_hans: 引擎

# windows_traceViewer_dataQuality
source: Data quality
zh_hans: 数据质量

# windows_traceViewer_chooseInvalid
source: Choose a .htrace, .ftrace, .systrace or .trace file.
zh_hans: 请选择 .htrace、.ftrace、.systrace 或 .trace 文件。

# windows_trace_capture_localOnly
source: The trace stays on this PC and opens automatically.
zh_hans: Trace 只保存在这台 电脑，并会在完成后自动打开。

# windows_viewer_advancedDump_search_shortcut
source: Search Advanced Dump (Ctrl+F)
zh_hans: 搜索 Advanced Dump（Ctrl+F）

# windows_viewer_tab_advancedDump
source: Advanced Dump
zh_hans: 高级转储

# windows_viewer_advancedDump_loading
source: Capturing componentDetail…
zh_hans: 正在采集 componentDetail…

# windows_viewer_advancedDump_noIds
source: This component has no numeric hostWindowId/componentId pair in the current capture
zh_hans: 当前采集中，此组件没有数字形式的 hostWindowId/componentId 组合
